In [118]:
import sys
!{sys.executable} -m pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: pip install --upgrade pip

In [119]:
import pandas as pd

In [120]:
pd.__version__

'2.2.3'

In [121]:
my_series = pd.Series([10,20,30,40,50], index =  ["a", "b", "c", "d", "e"])
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [122]:
type(my_series)

pandas.core.series.Series

In [123]:
my_series["a"]

np.int64(10)

In [124]:
my_series["b":"d"]

b    20
c    30
d    40
dtype: int64

In [125]:
my_series+5

a    15
b    25
c    35
d    45
e    55
dtype: int64

In [126]:
my_series/2

a     5.0
b    10.0
c    15.0
d    20.0
e    25.0
dtype: float64

In [127]:
type(my_series[0])

/var/folders/l8/cq7620ds1d9d3kqpv79rh4000000gn/T/ipykernel_48610/1721584435.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type(my_series[0])

numpy.int64

In [128]:
my_series.dtype

dtype('int64')

In [129]:
my_series.size

5

In [130]:
my_series.shape

(5,)

In [131]:
my_series.head()

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [132]:
my_series.tail(2)

d    40
e    50
dtype: int64

In [133]:
my_series.sort_values(ascending=False)

e    50
d    40
c    30
b    20
a    10
dtype: int64

In [134]:
data = {"Name":["John", "Jane", "Jim", "Jill"], "Age":[20,21,19,22], "City":["New York", "Los Angeles", "Chicago", "Houston"]}

In [135]:
data

{'Name': ['John', 'Jane', 'Jim', 'Jill'],
 'Age': [20, 21, 19, 22],
 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

In [136]:
df = pd.DataFrame(data)

In [137]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [138]:
data_list=[["John", 20, "New York"], ["Jane", 21, "Los Angeles"], ["Jim", 19, "Chicago"], ["Jill", 22, "Houston"]]

In [139]:
data_list

[['John', 20, 'New York'],
 ['Jane', 21, 'Los Angeles'],
 ['Jim', 19, 'Chicago'],
 ['Jill', 22, 'Houston']]

In [140]:
df_list = pd.DataFrame(data_list, columns=["Name", "Age", "City"])

In [141]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [142]:
import numpy as np

In [143]:
data_array = np.array([[1,2,3], [4,5,6], [7,8,9]])
data_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [144]:
df_array = pd.DataFrame(data_array, columns=["A", "B", "C"])

In [145]:
df_array

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [146]:
data = {"Name":["John", "Jane", "Jim", "Jill"], "Age":[20,21,19,22], "City":["New York", "Los Angeles", "Chicago", "Houston"]}
df = pd.DataFrame(data)
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [147]:
df.to_csv("example.csv", index=False)

In [148]:
data = pd.read_csv("example.csv")
data

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [149]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [150]:
import sys
!{sys.executable} -m pip install openpyxl

Requirement already satisfied: openpyxl in ./.venv/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in ./.venv/lib/python3.13/site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: pip install --upgrade pip

In [151]:
df.to_excel("example.xlsx", index=False)

In [152]:
data_excel = pd.read_excel("example.xlsx")
data_excel

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [153]:
data_excel.head()

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [154]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [155]:
df[["Name", "Age"]]

   Name  Age
0  John   20
1  Jane   21
2   Jim   19
3  Jill   22

In [156]:
type(df[["Name"]])

pandas.core.frame.DataFrame

In [157]:
df[["Name"]].values

array([['John'],
       ['Jane'],
       ['Jim'],
       ['Jill']], dtype=object)

In [158]:
df[df["Age"] >= 20]

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
3  Jill   22      Houston

In [159]:
df[df["Name"] == "John"]

   Name  Age      City
0  John   20  New York

In [160]:
df[((df["City"] == "New York") & (df["Age"] >= 20))]

   Name  Age      City
0  John   20  New York

In [161]:
selected_cities = ["New York", "Seattle"]

In [162]:
df[df["City"].isin(selected_cities)]

   Name  Age      City
0  John   20  New York

In [163]:
df[df["Name"].str.startswith("J")]

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [164]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [165]:
df.iloc[0 : 2]

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles

In [166]:
df.loc[df["Age"] > 20, ["Name", "City"]]

   Name         City
1  Jane  Los Angeles
3  Jill      Houston

In [167]:
np.nan

nan

In [168]:
data = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
df = pd.DataFrame(data)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [169]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [170]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [171]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [172]:
df.dropna(inplace = True)

In [173]:
df

     A    B  C
0  1.0  5.0  1

In [174]:
df = pd.DataFrame(data)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [175]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [176]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [177]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [178]:
df.fillna(df.median())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [179]:
df.fillna(method = "ffill")

/var/folders/l8/cq7620ds1d9d3kqpv79rh4000000gn/T/ipykernel_48610/1983593268.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill")

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [180]:
data = {"A": [1,2,3,4,5], "B": [10,20,30,40,50], "C": [100,200,300,400,500]}
df = pd.DataFrame(data, index = ['a','b','c','d','e'])
df

   A   B    C
a  1  10  100
b  2  20  200
c  3  30  300
d  4  40  400
e  5  50  500

In [181]:
df.loc['a':"c", ["B", "C"]]

    B    C
a  10  100
b  20  200
c  30  300

In [182]:
df

   A   B    C
a  1  10  100
b  2  20  200
c  3  30  300
d  4  40  400
e  5  50  500

In [183]:
df.iloc[0:3, [0,2]]

   A    C
a  1  100
b  2  200
c  3  300

In [184]:
df = {'Name': ['John', 'Jane', 'Jim', 'Jill'], 'Age': [20,21,19,22], 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(df)
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [185]:
df[df["Age"] > 20]

   Name  Age         City
1  Jane   21  Los Angeles
3  Jill   22      Houston

In [186]:
df[(df["City"] == "Chicago") & (df["Age"]< 30)]

  Name  Age     City
2  Jim   19  Chicago

In [187]:
df.query("Age > 28")

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [188]:
df.query("Age < 30 and City == 'Chicago'")

  Name  Age     City
2  Jim   19  Chicago

In [189]:
df.query("Age *2 > 50")

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [190]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [191]:
df.sort_values("Age", ascending=False)

   Name  Age         City
3  Jill   22      Houston
1  Jane   21  Los Angeles
0  John   20     New York
2   Jim   19      Chicago

In [192]:
df.sort_values(["City", "Age"])

   Name  Age         City
2   Jim   19      Chicago
3  Jill   22      Houston
1  Jane   21  Los Angeles
0  John   20     New York

In [193]:
df["Age"].rank()

0    2.0
1    3.0
2    1.0
3    4.0
Name: Age, dtype: float64

In [194]:
df["Age"].rank(method = "min")

0    2.0
1    3.0
2    1.0
3    4.0
Name: Age, dtype: float64

In [196]:
data1 = {"A": [1,2,3,4,5], "B": [10,20,30,40,50], "C": [100,200,300,400,500]}
data2 = {"A": [5,4,3,2,1], "B": [50,40,30,20,10], "C": [500,400,300,200,100]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [197]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [198]:
df2

   A   B    C
0  5  50  500
1  4  40  400
2  3  30  300
3  2  20  200
4  1  10  100

In [199]:
pd.concat([df1, df2])

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
0  5  50  500
1  4  40  400
2  3  30  300
3  2  20  200
4  1  10  100

In [200]:
pd.concat([df1, df2], axis=1)

   A   B    C  A   B    C
0  1  10  100  5  50  500
1  2  20  200  4  40  400
2  3  30  300  3  30  300
3  4  40  400  2  20  200
4  5  50  500  1  10  100

In [201]:
data3 = {"A": [1,2,3,4,5], "B": [10,20,30,40,50], "C": [100,200,300,400,500]}
df3 = pd.DataFrame(data3)

In [203]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [204]:
df3

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [202]:
pd.merge(df1, df3, on = "A")

   A  B_x  C_x  B_y  C_y
0  1   10  100   10  100
1  2   20  200   20  200
2  3   30  300   30  300
3  4   40  400   40  400
4  5   50  500   50  500

In [205]:
df.drop_duplicates()

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [206]:
df.drop_duplicates(subset = ["City"])

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [207]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [212]:
data = {"A": [1,2,3,4,5], "B": [10,20,30,40,50], "C": [100,200,300,400,500]}
df = pd.DataFrame(data)

In [216]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [214]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [219]:
q_low = df["B"].quantile(0.25)
q_high = df["B"].quantile(0.75)
q_range = q_high - q_low
lower_bound = 1.5 * q_range
upper_bound = 1.5 * q_range

In [221]:
df_filtered = df[df["B"].between(lower_bound, upper_bound)]
df_filtered

   A   B    C
2  3  30  300

In [234]:
data = {"Category": ["A", "B", "C", "A", "B", "C"], "Sales": [100, 200, 300, 400, 500, 600]}
df = pd.DataFrame(data)

In [223]:
df

  Category
0        A
1        B
2        C
3        A
4        B
5        C

In [226]:
pd.get_dummies(df["Category"])[["A", "B"]]

       A      B
0   True  False
1  False   True
2  False  False
3   True  False
4  False   True
5  False  False

In [228]:
!{sys.executable} -m pip install scikit-learn

Collecting scikit-learn
  Downloading scikit_learn-1.6.1-cp313-cp313-macosx_12_0_arm64.whl.metadata (31 kB)
Requirement already satisfied: numpy>=1.19.5 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (2.2.3)
Collecting scipy>=1.6.0 (from scikit-learn)
  Downloading scipy-1.15.2-cp313-cp313-macosx_12_0_arm64.whl.metadata (61 kB)
Collecting joblib>=1.2.0 (from scikit-learn)
  Downloading joblib-1.4.2-py3-none-any.whl.metadata (5.4 kB)
Collecting threadpoolctl>=3.1.0 (from scikit-learn)
  Downloading threadpoolctl-3.5.0-py3-none-any.whl.metadata (13 kB)
Downloading scikit_learn-1.6.1-cp313-cp313-macosx_12_0_arm64.whl (11.1 MB)
    11.1/11.1 MB 25.7 MB/s eta 0:00:00a 0:00:01
Downloading joblib-1.4.2-py3-none-any.whl (301 kB)
Downloading scipy-1.15.2-cp313-cp313-macosx_12_0_arm64.whl (30.1 MB)
    30.1/30.1 MB 46.9 MB/s eta 0:00:0000:0100:01
Downloading threadpoolctl-3.5.0-py3-none-any.whl (18 kB)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn
Successfully installed joblib-1.4.2 scikit-learn-1.6.1 scipy-1.15.2 threadpoolctl-3.5.0

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: pip install --upgrade pip

In [233]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df["Category_LabelEncoded"] = label_encoder.fit_transform(df["Category"])
df

  Category  Category_LabelEncoded
0        A                      0
1        B                      1
2        C                      2
3        A                      0
4        B                      1
5        C                      2

In [235]:
df.groupby("Category").size()

Category
A    2
B    2
C    2
dtype: int64

In [236]:
df.groupby("Category").agg({"Category":"count"})

          Category
Category
A                2
B                2
C                2

In [237]:
data = {"Name": ["John", "Jane", "Jim", "Jill"], "Age": [20,21,19,22], "City": ["New York", "Los Angeles", "Chicago", "Houston"]}
df = pd.DataFrame(data)
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [238]:
df

   Name  Age         City
0  John   20     New York
1  Jane   21  Los Angeles
2   Jim   19      Chicago
3  Jill   22      Houston

In [240]:
df_melted = pd.melt(df, id_vars = ["Name"], var_name = "Subject", value_name = "Score")

In [241]:
df_melted.pivot(index = "Name", columns = "Subject", values = "Score")

Subject Age         City
Name
Jane     21  Los Angeles
Jill     22      Houston
Jim      19      Chicago
John     20     New York

In [251]:
data = {"Date": ["2022-01-01", "2022-01-02", "2022-01-03", "2022-01-04", "2022-01-05"], "Sales": [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)

In [252]:
df

         Date  Sales
0  2022-01-01     10
1  2022-01-02     20
2  2022-01-03     30
3  2022-01-04     40
4  2022-01-05     50

In [256]:
df["Date"] = pd.to_datetime(df["Date"])
df.dtypes

Date     datetime64[ns]
Sales             int64
dtype: object

In [255]:
df

        Date  Sales
0 2022-01-01     10
1 2022-01-02     20
2 2022-01-03     30
3 2022-01-04     40
4 2022-01-05     50

In [258]:
df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month
df["Day"] = df["Date"].dt.day
df

        Date  Sales  Year  Month  Day
0 2022-01-01     10  2022      1    1
1 2022-01-02     20  2022      1    2
2 2022-01-03     30  2022      1    3
3 2022-01-04     40  2022      1    4
4 2022-01-05     50  2022      1    5

In [259]:
time_index = pd.date_range('2023-01-01', periods=5, freq="D")
ts_data = pd.Series([100, 200, 300, 400, 500], index=time_index)

In [260]:
ts_data

2023-01-01    100
2023-01-02    200
2023-01-03    300
2023-01-04    400
2023-01-05    500
Freq: D, dtype: int64

In [262]:
ts_resampled = ts_data.resample("W").mean()
ts_resampled

2023-01-01    100.0
2023-01-08    350.0
Freq: W-SUN, dtype: float64

In [264]:
df = {'Date': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'], 'Sales': [10, 20, 30, 40, 50]}
df = pd.DataFrame(df)
df

         Date  Sales
0  2022-01-01     10
1  2022-01-02     20
2  2022-01-03     30
3  2022-01-04     40
4  2022-01-05     50

In [265]:
df["Date"] = pd.to_datetime(df["Date"])

In [266]:
df.set_index("Date", inplace = True)

In [267]:
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [268]:
df["Shifted_Sales"] = df["Sales"].shift(1)
df["Lagged_Sales"] = df["Sales"].shift(-1)

In [269]:
df

            Sales  Shifted_Sales  Lagged_Sales
Date
2022-01-01     10            NaN          20.0
2022-01-02     20           10.0          30.0
2022-01-03     30           20.0          40.0
2022-01-04     40           30.0          50.0
2022-01-05     50           40.0           NaN

In [270]:
date_range = pd.date_range(start = "2023-01-01", periods = 100, freq = "W")

In [271]:
date_range

DatetimeIndex(['2023-01-01', '2023-01-08', '2023-01-15', '2023-01-22',
               '2023-01-29', '2023-02-05', '2023-02-12', '2023-02-19',
               '2023-02-26', '2023-03-05', '2023-03-12', '2023-03-19',
               '2023-03-26', '2023-04-02', '2023-04-09', '2023-04-16',
               '2023-04-23', '2023-04-30', '2023-05-07', '2023-05-14',
               '2023-05-21', '2023-05-28', '2023-06-04', '2023-06-11',
               '2023-06-18', '2023-06-25', '2023-07-02', '2023-07-09',
               '2023-07-16', '2023-07-23', '2023-07-30', '2023-08-06',
               '2023-08-13', '2023-08-20', '2023-08-27', '2023-09-03',
               '2023-09-10', '2023-09-17', '2023-09-24', '2023-10-01',
               '2023-10-08', '2023-10-15', '2023-10-22', '2023-10-29',
               '2023-11-05', '2023-11-12', '2023-11-19', '2023-11-26',
               '2023-12-03', '2023-12-10', '2023-12-17', '2023-12-24',
               '2023-12-31', '2024-01-07', '2024-01-14', '2024-01-21',
               '2024-01-28', '2024-02-04', '2024-02-11', '2024-02-18',
               '2024-02-25', '2024-03-03', '2024-03-10', '2024-03-17',
               '2024-03-24', '2024-03-31', '2024-04-07', '2024-04-14',
               '2024-04-21', '2024-04-28', '2024-05-05', '2024-05-12',
               '2024-05-19', '2024-05-26', '2024-06-02', '2024-06-09',
               '2024-06-16', '2024-06-23', '2024-06-30', '2024-07-07',
               '2024-07-14', '2024-07-21', '2024-07-28', '2024-08-04',
               '2024-08-11', '2024-08-18', '2024-08-25', '2024-09-01',
               '2024-09-08', '2024-09-15', '2024-09-22', '2024-09-29',
               '2024-10-06', '2024-10-13', '2024-10-20', '2024-10-27',
               '2024-11-03', '2024-11-10', '2024-11-17', '2024-11-24'],
              dtype='datetime64[ns]', freq='W-SUN')

In [272]:
data = {"Category": ["A", "B", "C", "A", "B", "C"], "Sales": [100, 200, 300, 400, 500, 600]}
df = pd.DataFrame(data)
df

  Category  Sales
0        A    100
1        B    200
2        C    300
3        A    400
4        B    500
5        C    600

In [273]:
df.groupby("Category").sum()

          Sales
Category
A           500
B           700
C           900

In [274]:
df.groupby("Category").agg(["sum", "mean", "std"])

         Sales
           sum   mean         std
Category
A          500  250.0  212.132034
B          700  350.0  212.132034
C          900  450.0  212.132034

In [275]:
data = {"Category": ["A", "B", "C", "A", "B", "C"], "Sales": [100, 200, 300, 400, 500, 600]}
df = pd.DataFrame(data)
df

  Category  Sales
0        A    100
1        B    200
2        C    300
3        A    400
4        B    500
5        C    600

In [277]:
df.groupby("Category").agg({"Sales":"sum"})

          Sales
Category
A           500
B           700
C           900

In [278]:
df.groupby("Category").agg({"Sales":"mean"})

          Sales
Category
A         250.0
B         350.0
C         450.0

In [279]:
custom_agg = lambda x: x.max() - x.min()

In [280]:
df

  Category  Sales
0        A    100
1        B    200
2        C    300
3        A    400
4        B    500
5        C    600

In [282]:
df.groupby("Category").agg({"Sales":custom_agg})

          Sales
Category
A           300
B           300
C           300

In [283]:
df.groupby("Category")["Sales"].agg(["sum", "mean", "std"])

          sum   mean         std
Category
A         500  250.0  212.132034
B         700  350.0  212.132034
C         900  450.0  212.132034

In [284]:
def custom_mean(values):
    return sum(values) / len(values)

df.groupby("Category")["Sales"].agg(custom_mean)

Category
A    250.0
B    350.0
C    450.0
Name: Sales, dtype: float64

In [287]:
data_range = pd.date_range(start = "2023-01-01", periods = 5, freq = "D")
ts_data = pd.Series([100, 200, 300, 400, 500], index=data_range)

In [288]:
!{sys.executable} -m pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.10.1-cp313-cp313-macosx_11_0_arm64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.1-cp313-cp313-macosx_11_0_arm64.whl.metadata (5.4 kB)
Collecting cycler>=0.10 (from matplotlib)
  Using cached cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.56.0-cp313-cp313-macosx_10_13_universal2.whl.metadata (101 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.8-cp313-cp313-macosx_11_0_arm64.whl.metadata (6.2 kB)
Requirement already satisfied: numpy>=1.23 in ./.venv/lib/python3.13/site-packages (from matplotlib) (2.2.3)
Requirement already satisfied: packaging>=20.0 in ./.venv/lib/python3.13/site-packages (from matplotlib) (24.2)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-11.1.0-cp313-cp313-macosx_11_0_arm64.whl.metadata (9.1 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Using cached pyparsing-3.2.1-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in ./.venv/lib/python3.13/site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.10.1-cp313-cp313-macosx_11_0_arm64.whl (8.0 MB)
    8.0/8.0 MB 46.7 MB/s eta 0:00:00
Downloading contourpy-1.3.1-cp313-cp313-macosx_11_0_arm64.whl (255 kB)
Using cached cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.56.0-cp313-cp313-macosx_10_13_universal2.whl (2.7 MB)
    2.7/2.7 MB 48.9 MB/s eta 0:00:00
Downloading kiwisolver-1.4.8-cp313-cp313-macosx_11_0_arm64.whl (65 kB)
Downloading pillow-11.1.0-cp313-cp313-macosx_11_0_arm64.whl (3.1 MB)
    3.1/3.1 MB 28.7 MB/s eta 0:00:00
Using cached pyparsing-3.2.1-py3-none-any.whl (107 kB)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib
Successfully installed contourpy-1.3.1 cycler-0.12.1 fonttools-4.56.0 kiwisolver-1.4.8 matplotlib-3.10.1 pillow-11.1.0 pyparsing-3.2.1

[notice] A new release of pip is available: 25.0 -> 25.0.1
[notice] To update, run: pip install --upgrade pip

In [ ]:
import matplotlib.pyplot as plt